from prettytable import PrettyTable

title = ['№', 'ПІП', "Вік", 'Категорія']
group_KN = ['№1', 'Баб`як Анна Орестівна', '18 років', '1 курс', '№2', 'Гупало Роман Романович', '18 років', '1 курс', '№3', 'Костюк Павло Юрійович', '18 років', '1 курс', '№4', 'Мазур Владислав Олександрович', '18 років', '1 курс', '№5', 'Олексин Влас Михайлович', '18 років', '1 курс', '№6', 'Рендович Руслан-Ігор Русланович', '18 років', '1 курс', '№7', 'Савчин Андрій Андрійович', '18 років', '1 курс', '№8', 'Семен Світлана Романівна', '18 років', '1 курс', '№9', 'Худьо Юрій Ігорович', '18 років', '1 курс', '№10', 'Банах Любомир Олегович', '18 років', '1 курс', '№11', 'Бородач Василь Вікторович', '18 років', '1 курс']

def table_data_KN():
    columns = len(title)  
    table = PrettyTable(title)  
    group_KN_data = group_KN[:]

    while group_KN_data:
        table.add_row(group_KN_data[:columns])
        group_KN_data = group_KN_data[columns:]
    print(table)
